In [34]:
 # Dependencies and Setup
import pandas as pd
import numpy as np

In [35]:
# File to Load 
file_path = "Resources/Lessons_04-Pandas_Homework_Instructions_HeroesOfPymoli_Resources_purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
heroes_file = pd.read_csv(file_path)

In [36]:
heroes_file.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [37]:
players_count = heroes_file ["SN"].nunique()
players_count

576

In [38]:
unique_items = heroes_file["Item Name"].nunique()
unique_items

179

In [39]:
average_price = heroes_file["Price"].mean()
average_price

3.050987179487176

In [40]:
purchases = heroes_file["Item ID"].count()
purchases

780

In [41]:
total_revenue = heroes_file["Price"].sum()
total_revenue

2379.77

In [42]:
#Hacemos dos dataframes para presentar los datos obtenidos
summarydf = pd.DataFrame({"Total Players": [576]})
summarydf

   Total Players
0            576

In [43]:
financialdf = pd.DataFrame({"Number of Unique Items": [179], "Average Price": [3.050987179487176], 
                           "Number of Purchases": [780], "Total Revenue": [2379.77]})
financialdf

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [44]:
#Gender demographics
group_gender = heroes_file.groupby("Gender")
group_gender.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [45]:
total_gender = group_gender["SN"].nunique()
total_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [46]:
gender_average = group_gender["Price"].mean()
gender_average

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [47]:
gender_total = group_gender["Price"].sum()
gender_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [48]:
gender_perperson = average_price/group_gender["SN"].count()
gender_perperson

Gender
Female                   0.027000
Male                     0.004679
Other / Non-Disclosed    0.203399
Name: SN, dtype: float64

In [49]:
#Average per person

In [50]:
heroes_norepeat = heroes_file.loc[ :, ["SN", "Age"]]
heroes_norepeat.drop_duplicates(subset=['SN'])
heroes_norepeat.head()

              SN  Age
0        Lisim78   20
1    Lisovynya38   40
2     Ithergue48   24
3  Chamassasya86   24
4      Iskosia90   23

In [51]:
#Age demographics
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "+40"]
pd.cut(heroes_norepeat["Age"], age_bins, labels=labels)

0      20-24
1        +40
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '+40']

In [52]:

heroes_norepeat["Age range"]= pd.cut(heroes_norepeat["Age"], age_bins, labels=labels)
age_group = heroes_norepeat.groupby("Age range")
age_group["Age range"].count()

Age range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
+40       13
Name: Age range, dtype: int64

In [53]:
#Purchasing analysis (Age)
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "+40"]
pd.cut(heroes_file["Age"], age_bins, labels=labels)

0      20-24
1        +40
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '+40']

In [63]:
heroes_file["Age group"]= pd.cut(heroes_file["Age"], age_bins, labels=labels)
age_purchasing_group = heroes_file.groupby("Age group")

In [66]:
age_purchasing_group["Price"].count()

Age group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
+40       13
Name: Price, dtype: int64

In [67]:
age_purchasing_group["Price"].mean()

Age group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
+40      2.941538
Name: Price, dtype: float64

In [68]:
age_purchasing_group["Price"].sum()

Age group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
+40        38.24
Name: Price, dtype: float64

In [77]:
#Top spenders
buyers_grouped = heroes_file.groupby("SN")
buyers_grouped["Price"].count()

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [78]:
buyers_grouped["Price"].mean()

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [79]:
buyers_grouped["Price"].sum()

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [80]:
#Most Popular items
popular_items = heroes_file.loc[ :, ["Item ID", "Item Name", "Price"]]
popular_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [85]:
grouped_popular = popular_items.groupby(["Item ID", "Item Name"])

In [88]:
grouped_popular.count()

                                                      Price
Item ID Item Name
0       Splinter                                          4
1       Crucifer                                          4
2       Verdict                                           6
3       Phantomlight                                      6
4       Bloodlord's Fetish                                5
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm     12
179     Wolf, Promise of the Moonwalker                   6
181     Reaper's Toll                                     5
182     Toothpick                                         3
183     Dragon's Greatsword                               3

[179 rows x 1 columns]

In [89]:
grouped_popular.sum()

                                                      Price
Item ID Item Name
0       Splinter                                       5.12
1       Crucifer                                      11.77
2       Verdict                                       14.88
3       Phantomlight                                  14.94
4       Bloodlord's Fetish                             8.50
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
179     Wolf, Promise of the Moonwalker               26.88
181     Reaper's Toll                                  8.30
182     Toothpick                                     12.09
183     Dragon's Greatsword                            3.27

[179 rows x 1 columns]

In [90]:
grouped_popular.mean()

                                                       Price
Item ID Item Name
0       Splinter                                      1.2800
1       Crucifer                                      2.9425
2       Verdict                                       2.4800
3       Phantomlight                                  2.4900
4       Bloodlord's Fetish                            1.7000
...                                                      ...
178     Oathbreaker, Last Hope of the Breaking Storm  4.2300
179     Wolf, Promise of the Moonwalker               4.4800
181     Reaper's Toll                                 1.6600
182     Toothpick                                     4.0300
183     Dragon's Greatsword                           1.0900

[179 rows x 1 columns]